### Terraform Plan — `dev` ⚠️ Changes pending
> Triggered by @mosavani on `pull_request` · 6d7bde4505708a0a44782fd909a46066fbf3ee56

<details><summary>Show plan</summary>

```hcl
module.github_ci_wif["hippo-helm-publisher"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_service_account.gke_nodes: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-image-publisher"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.networking.google_compute_network.vpc: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/global/networks/hippo-dev-vpc]
module.github_ci_wif["hippo-image-publisher"].google_project_iam_member.workload_roles["roles/artifactregistry.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.writer/serviceAccount:hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-helm-publisher"].google_project_iam_member.workload_roles["roles/artifactregistry.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.writer/serviceAccount:hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.github_ci_wif["hippo-image-publisher"].google_service_account_iam_member.github_actions_binding_org[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-image@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68730226170/locations/global/workloadIdentityPools/github-pool/attribute.repository_owner/mosavani]
module.github_ci_wif["hippo-helm-publisher"].google_service_account_iam_member.github_actions_binding_repo[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-hippo-helm-p@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68730226170/locations/global/workloadIdentityPools/github-pool/attribute.repository/mosavani/hippo_k8s-service]
module.iam.google_project_iam_member.gke_node_roles["roles/monitoring.viewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/monitoring.viewer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/stackdriver.resourceMetadata.writer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/artifactregistry.reader"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/storage.objectViewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/storage.objectViewer/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/monitoring.metricWriter/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_node_roles["roles/logging.logWriter"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/logging.logWriter/serviceAccount:hippo-dev-cluster-nodes@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.networking.google_compute_router.router: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/regions/us-central1/routers/hippo-dev-vpc-router]
module.networking.google_compute_subnetwork.primary: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/regions/us-central1/subnetworks/hippo-dev-subnet]
module.networking.google_compute_router_nat.nat: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/us-central1/hippo-dev-vpc-router/hippo-dev-vpc-nat]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/locations/us-central1-a/clusters/hippo-dev-cluster]
module.gke.google_container_node_pool.pools["default-pool"]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/locations/us-central1-a/clusters/hippo-dev-cluster/nodePools/default-pool]
module.workload_identity["gar-token-refresher"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["frontend-web"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["argocd-repo-server"].google_service_account.workload: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["frontend-web"].google_project_iam_member.workload_roles["roles/storage.objectViewer"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/storage.objectViewer/serviceAccount:hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["argocd-repo-server"].google_project_iam_member.workload_roles["roles/artifactregistry.reader"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]
module.workload_identity["frontend-web"].google_service_account_iam_member.workload_identity_binding[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-frontend-web@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[default/frontend-web]]
module.workload_identity["gar-token-refresher"].google_service_account_iam_member.workload_identity_binding[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/gar-token-refresher]]
module.workload_identity["argocd-repo-server"].google_service_account_iam_member.workload_identity_binding[0]: Refreshing state... [id=projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-argocd-repo@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/argocd-repo-server]]
module.workload_identity["gar-token-refresher"].google_project_iam_member.workload_roles["roles/artifactregistry.reader"]: Refreshing state... [id=project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke.google_container_cluster.primary has been deleted
  - resource "google_container_cluster" "primary" {
      - endpoint                                 = "34.60.73.226" -> null
      - id                                       = "projects/project-ec2467ed-84cd-4898-b5b/locations/us-central1-a/clusters/hippo-dev-cluster" -> null
      - location                                 = "us-central1-a" -> null
      - master_version                           = "1.34.3-gke.1245000" -> null
      - name                                     = "hippo-dev-cluster" -> null
      - self_link                                = "https://container.googleapis.com/v1/projects/project-ec2467ed-84cd-4898-b5b/zones/us-central1-a/clusters/hippo-dev-cluster" -> null
        # (29 unchanged attributes hidden)

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUo2S1lMdGUzK3FpemRzank5ZTBTSlF3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1pHRTBNV1l4WkdNdE5XRmhZUzAwTUdVM0xXRXhOREF0TVdZMk1EZzBNRGhpTm1FegpNQ0FYRFRJMk1ESXlNekF3TVRrMU0xb1lEekl3TlRZd01qRTJNREV4T1RVeldqQXZNUzB3S3dZRFZRUURFeVJrCllUUXhaakZrWXkwMVlXRmhMVFF3WlRjdFlURTBNQzB4WmpZd09EUXdPR0kyWVRNd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEUWEzbWJ4eWZuMThqUy9STWNtSkJmTFpzWk50ZnAzQ1JkcWQxNQppZ1grdHpaVDIwVkZuTDd2UGJlZHJyVldKR3Q5am1TYkJDWGlDbmFucGptd3JzY1VtdUFPeEQyTTA3Y2RMNk51Ckl0QkVLRU9qWGhRYmRoUVNyQm9xYjBEc3BsQkdYZE9ZRU9KSkZYdjF4YVVVWEhwa0FlUms1ek9KN3l4T1JacGcKelFWb3UrTFdoQ09YeG9ZaHNIY0pIN2FkZWoyblAyZExVdHNVV3I0L21mRDg3Z25zblQxeXVCMk9waWhCaGFaNAptT3U3allOQm1UTkhKdHRLK3lPNGQ4NjNaT0JiSmY3YnU2MDdtSDJTME1WN3RyNUEzQzdsQWdVNzNjUmkrSnoyCkNNN0RpSnhnb2lXdSs0SGpnVkRBMDdjbHl3UWhUMmdtOFBTQVA2NW1WOHpxMUxobW5LK0JSOE9OdGlqRi82d2wKQmt0SmpsTG5MQitIRCtyRmhwU3VTT0M3Y3pWU3JXUzJaM3drNE9HbGc2aVBDU1NWTU1RdDZ4QmJHVnVDNGxlRgpuRDFhZ1phR3dRVmNiZkF2WlpzWWJOamF3SVQvdzV4WUc1L3JsS0NyQ1hNWXAydjE2US9lV0hsdXhNQ1ptQ05BCi9MRHQ4d242aS9ZYVNnWlVCUmt6M3dwUzRia0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGS0JobmtpcEJtM0ZmeWkrNU5wcC9RQm5XV29oTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQm02OUwzS2xMWENlVnE4eHBXZWJteWIwZ3VwMW9Cekw3T1IwUEdQOUhMCm16ejNWWW9DMjYyQXFmd0hpdjhrUGFiRVNPajZ2Wk5XRzJNOWVtRTFBUUtHL29IZkgyVWR0amFYYTlrSmgrZHAKZC90L05xSmdabVBuaW9qYWlPSHZ6WUtxbE85STlCNjZmRlovYW5KMTZya0lSMTJXWThQc2VYc2VUdy8ydi85awo3MXloN3lUWUZKdFg5Y3pEMmttaTdpWFJQUUd0N29oZzJBTFJ2RFNQdGZzMTI4d1ZiL3dUVERaU296MTlJQ0tFCjk0NW84UlVKcExFUnBKVXRRQUZ2aG5VYmVWTWJRcnlEek5LaG9uM21jTXVvckNXb1p3WHNxK2l1ZUNrSFh4aHQKbTBsZjh1QTVreWlya2VubXh0WlczUlFWaGxaUlE1RGxweUQxRGRzcnFLbmNFcXJON0V2aklJMW5yV0MvbG9WegovcllLTnBZenFvdDJWQ1psSUpvcVRya2NSbzREK2QrMWVyYVNBbGFBRnlGSTcvcGowUEc5d0N1d04xczdzZFVtCktrOUQ2QjJZbzBSQUpyOE1KT0VOVzROekV0d01vaW02Y0kyZExJU2I1RGcyR2MwbTFoS2Q5MEs3U0tnQWtvbTcKdEN0cG52UkdGbWgrdHpTdEs5M1ZMSWs9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

            # (1 unchanged block hidden)
        }

        # (27 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "cost-center"                = "engineering"
          + "environment"                = "dev"
          + "git-repository"             = "hippo_cloud"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "team"                       = "platform"
          + "tf-module"                  = "gke"
          + "tf-workspace"               = "default"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1-a"
      + logging_service                          = "logging.googleapis.com/kubernetes"
      + master_version                           = (known after apply)
      + monitoring_service                       = "monitoring.googleapis.com/kubernetes"
      + name                                     = "hippo-dev-cluster"
      + network                                  = "https://www.googleapis.com/compute/v1/projects/project-ec2467ed-84cd-4898-b5b/global/networks/hippo-dev-vpc"
      + networking_mode                          = "VPC_NATIVE"
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "project-ec2467ed-84cd-4898-b5b"
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "cost-center"    = "engineering"
          + "environment"    = "dev"
          + "git-repository" = "hippo_cloud"
          + "managed-by"     = "terraform"
          + "team"           = "platform"
          + "tf-module"      = "gke"
          + "tf-workspace"   = "default"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "https://www.googleapis.com/compute/v1/projects/project-ec2467ed-84cd-4898-b5b/regions/us-central1/subnetworks/hippo-dev-subnet"
      + terraform_labels                         = {
          + "cost-center"                = "engineering"
          + "environment"                = "dev"
          + "git-repository"             = "hippo_cloud"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "team"                       = "platform"
          + "tf-module"                  = "gke"
          + "tf-workspace"               = "default"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = true
            }
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "hippo-dev-subnet-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "hippo-dev-subnet-services"
          + stack_type                    = "IPV4"
        }

      + maintenance_policy {
          + recurring_window {
              + end_time   = "2024-01-01T08:00:00Z"
              + recurrence = "FREQ=WEEKLY;BYDAY=MO,TU,WE,TH,FR,SA,SU"
              + start_time = "2024-01-01T02:00:00Z"
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled      = (known after apply)
          + private_endpoint_enforcement_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = "0.0.0.0/0"
              + display_name = "allow-all-dev"
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.16.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "project-ec2467ed-84cd-4898-b5b.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.pools["default-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "hippo-dev-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "project-ec2467ed-84cd-4898-b5b"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 3
          + min_node_count  = 1
        }

      + node_config {
          + disk_size_gb     = 20
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = "COS_CONTAINERD"
          + labels           = {
              + "cost-center"    = "engineering"
              + "environment"    = "dev"
              + "git-repository" = "hippo_cloud"
              + "managed-by"     = "terraform"
              + "pool"           = "default"
              + "team"           = "platform"
              + "tf-module"      = "gke"
              + "tf-workspace"   = "default"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-standard-2"
          + metadata         = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = true
          + tags             = [
              + "gke-node",
              + "hippo-dev",
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"
        }
    }

  # module.workload_identity["gar-token-refresher"].google_project_iam_member.workload_roles["roles/artifactregistry.reader"] will be destroyed
  # (because module.workload_identity["gar-token-refresher"] is not in configuration)
  - resource "google_project_iam_member" "workload_roles" {
      - etag    = "BwZLhZJBjRE=" -> null
      - id      = "project-ec2467ed-84cd-4898-b5b/roles/artifactregistry.reader/serviceAccount:hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - project = "project-ec2467ed-84cd-4898-b5b" -> null
      - role    = "roles/artifactregistry.reader" -> null
    }

  # module.workload_identity["gar-token-refresher"].google_service_account.workload will be destroyed
  # (because module.workload_identity["gar-token-refresher"] is not in configuration)
  - resource "google_service_account" "workload" {
      - account_id   = "hippo-dev-cluster-gar-token-re" -> null
      - description  = "Workload Identity SA for gar-token-refresher running in argocd/gar-token-refresher" -> null
      - disabled     = false -> null
      - display_name = "gar-token-refresher (dev)" -> null
      - email        = "hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - id           = "projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - name         = "projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
      - project      = "project-ec2467ed-84cd-4898-b5b" -> null
      - unique_id    = "105259015563064985038" -> null
    }

  # module.workload_identity["gar-token-refresher"].google_service_account_iam_member.workload_identity_binding[0] will be destroyed
  # (because module.workload_identity["gar-token-refresher"] is not in configuration)
  - resource "google_service_account_iam_member" "workload_identity_binding" {
      - etag               = "BwZLhZIKYtk=" -> null
      - id                 = "projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/gar-token-refresher]" -> null
      - member             = "serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/gar-token-refresher]" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/project-ec2467ed-84cd-4898-b5b/serviceAccounts/hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com" -> null
    }

  # module.workload_identity["image-updater"].google_project_iam_member.workload_roles["roles/artifactregistry.reader"] will be created
  + resource "google_project_iam_member" "workload_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:hippo-dev-cluster-image-update@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + project = "project-ec2467ed-84cd-4898-b5b"
      + role    = "roles/artifactregistry.reader"
    }

  # module.workload_identity["image-updater"].google_service_account.workload will be created
  + resource "google_service_account" "workload" {
      + account_id   = "hippo-dev-cluster-image-update"
      + description  = "Workload Identity SA for image-updater running in argocd/argocd-image-updater"
      + disabled     = false
      + display_name = "image-updater (dev)"
      + email        = "hippo-dev-cluster-image-update@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:hippo-dev-cluster-image-update@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "project-ec2467ed-84cd-4898-b5b"
      + unique_id    = (known after apply)
    }

  # module.workload_identity["image-updater"].google_service_account_iam_member.workload_identity_binding[0] will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:project-ec2467ed-84cd-4898-b5b.svc.id.goog[argocd/argocd-image-updater]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate     = (sensitive value)
  ~ cluster_endpoint           = (sensitive value)
  ~ wi_k8s_annotations         = {
      - gar-token-refresher = "iam.gke.io/gcp-service-account: hippo-dev-cluster-gar-token-re@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
      + image-updater       = "iam.gke.io/gcp-service-account: hippo-dev-cluster-image-update@project-ec2467ed-84cd-4898-b5b.iam.gserviceaccount.com"
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>